#Использовать asserts
#Использовать "../../src"

#Область Тесты

&Тест
Процедура ТестДолжен_СохранитьСетевойПорядокБайтов() Экспорт

	// Подготовка
	IPv4Данные = ПолучитьДвоичныеДанныеИзHexСтроки("C0000201");
	IPv6Данные = ПолучитьДвоичныеДанныеИзHexСтроки("20010DB8000000000000000000000001");

	// Действие
	IPv4 = Новый IPАдрес(IPv4Данные);
	IPv6 = Новый IPАдрес(IPv6Данные);

	// Проверка
	Ожидаем.Что(IPv4.Версия()).Равно(4);
	Ожидаем.Что(ПолучитьHexСтрокуИзДвоичныхДанных(IPv4.Байты())).Равно("C0000201");
	Ожидаем.Что(IPv6.Версия()).Равно(6);
	Ожидаем.Что(ПолучитьHexСтрокуИзДвоичныхДанных(IPv6.Байты()))
		.Равно("20010DB8000000000000000000000001");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВернутьНовыеНеизменяемыеКоллекцииОктетов() Экспорт

	// Подготовка
	Адрес = Новый IPАдрес(ПолучитьДвоичныеДанныеИзHexСтроки("C0000201"));

	// Действие
	ПервыйРезультат = Адрес.Октеты();
	ВторойРезультат = Адрес.Октеты();

	// Проверка
	Ожидаем.Что(ПервыйРезультат = ВторойРезультат).ЭтоЛожь();
	Ожидаем.Что(ПервыйРезультат).ИмеетТип("ФиксированныйМассив");
	Ожидаем.Что(ПервыйРезультат.Количество()).Равно(4);
	Ожидаем.Что(ПервыйРезультат[0]).Равно(192);

КонецПроцедуры

#КонецОбласти
