#Использовать asserts
#Использовать "../../src"

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("192.0.2.1")
&ИсточникЗначение("2001:0DB8:0:0:0:0:0:1")
&ИсточникЗначение("::ffff:192.0.2.1")
&ИсточникЗначение("fe80::1%eth0")
Процедура ТестДолжен_СохранятьАдресПриТекстовомПовторномРазборе(Вход) Экспорт

	// Подготовка
	ИсходныйАдрес = Новый IPАдрес(Вход);

	// Действие
	ПовторноРазобранный = Новый IPАдрес(ИсходныйАдрес.ВСтроку());

	// Проверка
	Ожидаем.Что(ПовторноРазобранный.Равно(ИсходныйАдрес)).ЭтоИстина();

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("192.0.2.1")
&ИсточникЗначение("2001:db8::1")
&ИсточникЗначение("::ffff:192.0.2.1")
&ИсточникЗначение("fe80::1%eth0")
Процедура ТестДолжен_СохранятьБитыПриДвоичномПовторномРазборе(Вход) Экспорт

	// Подготовка
	ИсходныйАдрес = Новый IPАдрес(Вход);
	ИсходныеБайты = ПолучитьHexСтрокуИзДвоичныхДанных(ИсходныйАдрес.ДвоичныеДанные());

	// Действие
	ПовторноРазобранный = Новый IPАдрес(ИсходныйАдрес.ДвоичныеДанные());

	// Проверка
	Ожидаем.Что(ПовторноРазобранный.РавноБезУчетаЗоны(ИсходныйАдрес)).ЭтоИстина();
	Ожидаем.Что(ПолучитьHexСтрокуИзДвоичныхДанных(ПовторноРазобранный.ДвоичныеДанные())).Равно(ИсходныеБайты);
	Ожидаем.Что(ПовторноРазобранный.ИмеетЗону()).ЭтоЛожь();

КонецПроцедуры

&Тест
Процедура ТестДолжен_СоблюдатьЗаконыПорядкаIPАдресов() Экспорт

	// Подготовка
	Первый = Новый IPАдрес("192.0.2.1");
	Второй = Новый IPАдрес("::1");
	Третий = Новый IPАдрес("2001:db8::1");

	// Действие
	ПервыйСоВторым = Первый.Сравнить(Второй);
	ВторойСПервым = Второй.Сравнить(Первый);
	ВторойСТретьим = Второй.Сравнить(Третий);
	ПервыйСТретьим = Первый.Сравнить(Третий);

	// Проверка
	Ожидаем.Что(ПервыйСоВторым).Равно(-1);
	Ожидаем.Что(ВторойСПервым).Равно(1);
	Ожидаем.Что(ВторойСТретьим).Равно(-1);
	Ожидаем.Что(ПервыйСТретьим).Равно(-1);

КонецПроцедуры

#КонецОбласти
