#Использовать asserts
#Использовать "../../src"

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("0.0.0.0", Истина)
&ИсточникЗначение("0.0.0.1", Ложь)
&ИсточникЗначение("::", Истина)
&ИсточникЗначение("::1", Ложь)
&ИсточникЗначение("::ffff:0.0.0.0", Ложь)
Процедура ТестДолжен_РаспознаватьНезаданныеАдреса(Вход, Ожидаемое) Экспорт

	// Действие
	Результат = Новый IPАдрес(Вход).ЭтоНезаданный();

	// Проверка
	Ожидаем.Что(Результат).Равно(Ожидаемое);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("126.255.255.255", Ложь)
&ИсточникЗначение("127.0.0.0", Истина)
&ИсточникЗначение("127.1.2.3", Истина)
&ИсточникЗначение("127.255.255.255", Истина)
&ИсточникЗначение("128.0.0.0", Ложь)
&ИсточникЗначение("::1", Истина)
&ИсточникЗначение("::2", Ложь)
&ИсточникЗначение("::ffff:127.1.2.3", Ложь)
Процедура ТестДолжен_РаспознаватьПетлевыеАдреса(Вход, Ожидаемое) Экспорт

	// Действие
	Результат = Новый IPАдрес(Вход).ЭтоПетлевой();

	// Проверка
	Ожидаем.Что(Результат).Равно(Ожидаемое);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("169.253.255.255", Ложь)
&ИсточникЗначение("169.254.0.0", Истина)
&ИсточникЗначение("169.254.1.1", Истина)
&ИсточникЗначение("169.254.255.255", Истина)
&ИсточникЗначение("169.255.0.0", Ложь)
&ИсточникЗначение("fe7f::", Ложь)
&ИсточникЗначение("fe80::1%eth0", Истина)
&ИсточникЗначение("febf:ffff:ffff:ffff:ffff:ffff:ffff:ffff", Истина)
&ИсточникЗначение("fec0::", Ложь)
&ИсточникЗначение("::ffff:169.254.1.1", Ложь)
Процедура ТестДолжен_РаспознаватьЛокальныеДляКаналаАдреса(Вход, Ожидаемое) Экспорт

	// Действие
	Результат = Новый IPАдрес(Вход).ЭтоЛокальныйДляКанала();

	// Проверка
	Ожидаем.Что(Результат).Равно(Ожидаемое);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("9.255.255.255", Ложь)
&ИсточникЗначение("10.0.0.0", Истина)
&ИсточникЗначение("10.255.255.255", Истина)
&ИсточникЗначение("11.0.0.0", Ложь)
&ИсточникЗначение("172.15.255.255", Ложь)
&ИсточникЗначение("172.16.0.0", Истина)
&ИсточникЗначение("172.31.255.255", Истина)
&ИсточникЗначение("172.32.0.0", Ложь)
&ИсточникЗначение("192.167.255.255", Ложь)
&ИсточникЗначение("192.168.0.0", Истина)
&ИсточникЗначение("192.168.255.255", Истина)
&ИсточникЗначение("192.169.0.0", Ложь)
&ИсточникЗначение("fbff:ffff:ffff:ffff:ffff:ffff:ffff:ffff", Ложь)
&ИсточникЗначение("fc00::", Истина)
&ИсточникЗначение("fd00::1", Истина)
&ИсточникЗначение("fdff:ffff:ffff:ffff:ffff:ffff:ffff:ffff", Истина)
&ИсточникЗначение("fe00::", Ложь)
&ИсточникЗначение("::ffff:10.1.2.3", Ложь)
Процедура ТестДолжен_РаспознаватьЧастныеАдреса(Вход, Ожидаемое) Экспорт

	// Действие
	Результат = Новый IPАдрес(Вход).ЭтоЧастный();

	// Проверка
	Ожидаем.Что(Результат).Равно(Ожидаемое);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("223.255.255.255", Ложь)
&ИсточникЗначение("224.0.0.0", Истина)
&ИсточникЗначение("224.0.0.1", Истина)
&ИсточникЗначение("239.255.255.255", Истина)
&ИсточникЗначение("240.0.0.0", Ложь)
&ИсточникЗначение("feff:ffff:ffff:ffff:ffff:ffff:ffff:ffff", Ложь)
&ИсточникЗначение("ff00::", Истина)
&ИсточникЗначение("ff02::1", Истина)
Процедура ТестДолжен_РаспознаватьГрупповыеАдреса(Вход, Ожидаемое) Экспорт

	// Действие
	Результат = Новый IPАдрес(Вход).ЭтоГрупповой();

	// Проверка
	Ожидаем.Что(Результат).Равно(Ожидаемое);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("192.0.1.255", Ложь)
&ИсточникЗначение("192.0.2.0", Истина)
&ИсточникЗначение("192.0.2.1", Истина)
&ИсточникЗначение("192.0.2.255", Истина)
&ИсточникЗначение("192.0.3.0", Ложь)
&ИсточникЗначение("198.51.99.255", Ложь)
&ИсточникЗначение("198.51.100.0", Истина)
&ИсточникЗначение("198.51.100.1", Истина)
&ИсточникЗначение("198.51.100.255", Истина)
&ИсточникЗначение("198.51.101.0", Ложь)
&ИсточникЗначение("203.0.112.255", Ложь)
&ИсточникЗначение("203.0.113.0", Истина)
&ИсточникЗначение("203.0.113.1", Истина)
&ИсточникЗначение("203.0.113.255", Истина)
&ИсточникЗначение("203.0.114.0", Ложь)
&ИсточникЗначение("2001:db7:ffff:ffff:ffff:ffff:ffff:ffff", Ложь)
&ИсточникЗначение("2001:db8::", Истина)
&ИсточникЗначение("2001:db8::1", Истина)
&ИсточникЗначение("2001:db8:ffff:ffff:ffff:ffff:ffff:ffff", Истина)
&ИсточникЗначение("2001:db9::", Ложь)
&ИсточникЗначение("::ffff:192.0.2.1", Ложь)
Процедура ТестДолжен_РаспознаватьАдресаДляДокументации(Вход, Ожидаемое) Экспорт

	// Действие
	Результат = Новый IPАдрес(Вход).ПредназначенДляДокументации();

	// Проверка
	Ожидаем.Что(Результат).Равно(Ожидаемое);

КонецПроцедуры

#КонецОбласти
