#Использовать asserts
#Использовать "../../src"

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("192.0.2.255", "192.0.3.0")
&ИсточникЗначение("2001:db8::ffff", "2001:db8::1:0")
&ИсточникЗначение("fe80::1%eth0", "fe80::2")
Процедура ТестДолжен_ВернутьСледующийАдрес(Исходный, Ожидаемый) Экспорт

	// Действие
	Результат = Новый IPАдрес(Исходный).Следующий();

	// Проверка
	Ожидаем.Что(Результат.ВСтроку()).Равно(Ожидаемый);
	Ожидаем.Что(Результат.ИмеетЗону()).ЭтоЛожь();

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("192.0.3.0", "192.0.2.255")
&ИсточникЗначение("2001:db8::1:0", "2001:db8::ffff")
&ИсточникЗначение("fe80::2%eth0", "fe80::1")
Процедура ТестДолжен_ВернутьПредыдущийАдрес(Исходный, Ожидаемый) Экспорт

	// Действие
	Результат = Новый IPАдрес(Исходный).Предыдущий();

	// Проверка
	Ожидаем.Что(Результат.ВСтроку()).Равно(Ожидаемый);
	Ожидаем.Что(Результат.ИмеетЗону()).ЭтоЛожь();

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("255.255.255.255")
&ИсточникЗначение("ffff:ffff:ffff:ffff:ffff:ffff:ffff:ffff")
Процедура ТестДолжен_ВернутьНеопределеноПослеМаксимальногоАдреса(Исходный) Экспорт

	// Действие
	Результат = Новый IPАдрес(Исходный).Следующий();

	// Проверка
	Ожидаем.Что(Результат).Равно(Неопределено);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("0.0.0.0")
&ИсточникЗначение("::")
Процедура ТестДолжен_ВернутьНеопределеноПередМинимальнымАдресом(Исходный) Экспорт

	// Действие
	Результат = Новый IPАдрес(Исходный).Предыдущий();

	// Проверка
	Ожидаем.Что(Результат).Равно(Неопределено);

КонецПроцедуры

#КонецОбласти
