#Использовать asserts
#Использовать "../../src"

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("192.0.2.1:00443")
&ИсточникЗначение("[2001:0DB8:0:0:0:0:0:1]:00443")
&ИсточникЗначение("[fe80::1%eth0]:0")
Процедура ТестДолжен_СохранятьКонечнуюТочкуПриКаноническомПовторномРазборе(Вход) Экспорт

	// Подготовка
	Исходная = Новый IPКонечнаяТочка(Вход);

	// Действие
	ПовторноРазобранная = Новый IPКонечнаяТочка(Исходная.ВСтроку());

	// Проверка
	Ожидаем.Что(ПовторноРазобранная.Равно(Исходная)).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_СоблюдатьЗаконыПорядкаКонечныхТочек() Экспорт

	// Подготовка
	Первый = Новый IPКонечнаяТочка("192.0.2.1:0");
	Второй = Новый IPКонечнаяТочка("192.0.2.1:443");
	Третий = Новый IPКонечнаяТочка("192.0.2.1:65535");

	// Действие
	ПервыйСоВторым = Первый.Сравнить(Второй);
	ВторойСПервым = Второй.Сравнить(Первый);
	ВторойСТретьим = Второй.Сравнить(Третий);
	ПервыйСТретьим = Первый.Сравнить(Третий);

	// Проверка
	Ожидаем.Что(ПервыйСоВторым).Равно(-1);
	Ожидаем.Что(ВторойСПервым).Равно(1);
	Ожидаем.Что(ВторойСТретьим).Равно(-1);
	Ожидаем.Что(ПервыйСТретьим).Равно(-1);

КонецПроцедуры

#КонецОбласти
