#Использовать asserts
#Использовать errors
#Использовать "../fixtures"
#Использовать "../../src"

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("192.0.2.0/24", "192.0.2.0/24", Истина)
&ИсточникЗначение("2001:0db8:0:0::/32", "2001:db8::/32", Истина)
&ИсточникЗначение("192.0.2.0/24", "192.0.2.0/25", Ложь)
&ИсточникЗначение("192.0.2.0/24", "192.0.3.0/24", Ложь)
&ИсточникЗначение("192.0.2.0/24", "2001:db8::/32", Ложь)
Процедура ТестДолжен_СравнитьПрефиксыНаРавенство(ПервыйТекст, ВторойТекст, Ожидание) Экспорт

	// Подготовка
	Первый = Новый IPПрефикс(ПервыйТекст);
	Второй = Новый IPПрефикс(ВторойТекст);

	// Действие
	Результат = Первый.Равно(Второй);

	// Проверка
	Ожидаем.Что(Результат).Равно(Ожидание);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("192.0.2.0/24")
&ИсточникЗначение(Null)
&ИсточникЗначение(Неопределено)
Процедура ТестДолжен_ВернутьЛожьДляДругогоТипаПриРавенстве(Другой) Экспорт

	// Подготовка
	Префикс = Новый IPПрефикс("192.0.2.0/24");

	// Действие
	Результат = Префикс.Равно(Другой);

	// Проверка
	Ожидаем.Что(Результат).ЭтоЛожь();

КонецПроцедуры

#КонецОбласти
