#Использовать "../src"

Перем _КонечнаяТочкаIPv4;
Перем _КонечнаяТочкаIPv6;
Перем _ДругаяКонечнаяТочкаIPv4;
Перем _ДругаяКонечнаяТочкаIPv6;

#Область ОбработчикиСобытий

&МониторингПамяти
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ПередКаждымКейсом
Процедура ПодготовитьIPКонечныеТочки(Контекст) Экспорт

	_КонечнаяТочкаIPv4 = Новый IPКонечнаяТочка("192.0.2.1:443");
	_КонечнаяТочкаIPv6 = Новый IPКонечнаяТочка("[2001:db8::1]:443");
	_ДругаяКонечнаяТочкаIPv4 = Новый IPКонечнаяТочка("192.0.2.1:443");
	_ДругаяКонечнаяТочкаIPv6 = Новый IPКонечнаяТочка("[2001:db8::1]:443");

КонецПроцедуры

#КонецОбласти

#Область Бенчмарки

// Разбирает конечную точку IPv4.
&Бенчмарк(Наименование = "IPv4 из строки")
&Категория("Создание")
Процедура РазобратьКонечнуюТочкуIPv4() Экспорт

	Результат = Новый IPКонечнаяТочка("192.0.2.1:443");

КонецПроцедуры

// Разбирает конечную точку IPv6 по синтаксису узла RFC 3986.
&Бенчмарк(Наименование = "IPv6 из строки")
&Категория("Создание")
Процедура РазобратьКонечнуюТочкуIPv6() Экспорт

	Результат = Новый IPКонечнаяТочка("[2001:db8::1]:443");

КонецПроцедуры

// Форматирует конечную точку IPv4.
&Бенчмарк(Наименование = "IPv4")
&Категория("Форматирование")
Процедура ФорматироватьКонечнуюТочкуIPv4() Экспорт

	Результат = _КонечнаяТочкаIPv4.ВСтроку();

КонецПроцедуры

// Форматирует конечную точку IPv6 по синтаксису узла RFC 3986.
&Бенчмарк(Наименование = "IPv6")
&Категория("Форматирование")
Процедура ФорматироватьКонечнуюТочкуIPv6() Экспорт

	Результат = _КонечнаяТочкаIPv6.ВСтроку();

КонецПроцедуры

// Проверяет равенство конечных точек IPv4.
&Бенчмарк(Наименование = "Равенство IPv4")
&Категория("Операции")
Процедура ПроверитьРавенствоIPv4() Экспорт

	Результат = _КонечнаяТочкаIPv4.Равно(_ДругаяКонечнаяТочкаIPv4);

КонецПроцедуры

// Проверяет равенство конечных точек IPv6.
&Бенчмарк(Наименование = "Равенство IPv6")
&Категория("Операции")
Процедура ПроверитьРавенствоIPv6() Экспорт

	Результат = _КонечнаяТочкаIPv6.Равно(_ДругаяКонечнаяТочкаIPv6);

КонецПроцедуры

// Сравнивает конечные точки IPv4.
&Бенчмарк(Наименование = "Сравнение IPv4")
&Категория("Операции")
Процедура СравнитьIPv4() Экспорт

	Результат = _КонечнаяТочкаIPv4.Сравнить(_ДругаяКонечнаяТочкаIPv4);

КонецПроцедуры

// Сравнивает конечные точки IPv6.
&Бенчмарк(Наименование = "Сравнение IPv6")
&Категория("Операции")
Процедура СравнитьIPv6() Экспорт

	Результат = _КонечнаяТочкаIPv6.Сравнить(_ДругаяКонечнаяТочкаIPv6);

КонецПроцедуры

#КонецОбласти
